resources/xmlfiles/taxlink/om-editorderaddunreferencedlineitem.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.vertexinc.com/vertextl/taxIntegration/types/">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>uuid:7d5dda1a-5ca0-4a0d-95f9-71161ee7a45a</wsa:MessageID>
		<wsa:Action>calculation</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<typ:calculation>
			<typ:trxHeader>
				<typ:ApplicationId>10046</typ:ApplicationId>
				<typ:DefaultTaxationCountry>US</typ:DefaultTaxationCountry>
				<typ:EntityCode>ORDER</typ:EntityCode>
				<typ:EventClassCode>SALES_TRANSACTION_TAX_QUOTE</typ:EventClassCode>
				<typ:EstablishmentId>300000001140071</typ:EstablishmentId>
				<typ:EstablishmentNumber>1004</typ:EstablishmentNumber>
				<typ:EventClassMappingId>0</typ:EventClassMappingId>
				<typ:EventTypeCode>ORDER_CREATED</typ:EventTypeCode>
				<typ:EndPointUrl>https://ecog-dev1.fa.us2.oraclecloud.com</typ:EndPointUrl>
				<typ:FirstPtyOrgId>300000004221936</typ:FirstPtyOrgId>
				<typ:HdrTrxUserKey1>CALCULATE_QUOTE</typ:HdrTrxUserKey1>
				<typ:HqEstbPartyTaxProfId>300000001140209</typ:HqEstbPartyTaxProfId>
				<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
				<typ:LedgerId>300000001139008</typ:LedgerId>
				<typ:LegalEntityId>300000001140053</typ:LegalEntityId>
				<typ:LegalEntityNumber>RIUS104111</typ:LegalEntityNumber>
				<typ:LogLevel>SEVERE</typ:LogLevel>
				<typ:TrxCurrencyCode>USD</typ:TrxCurrencyCode>
				<typ:TrxDate>2022-11-01</typ:TrxDate>
				<typ:TrxId>756899</typ:TrxId>
			</typ:trxHeader>
			<typ:trxLineList>
				<typ:trxLine>
					<typ:ApplicationId>10046</typ:ApplicationId>
					<typ:AssessableValue>4000</typ:AssessableValue>
					<typ:BillFromGeographyType1>ADDRESS1</typ:BillFromGeographyType1>
					<typ:BillFromGeographyType10>PROVINCE</typ:BillFromGeographyType10>
					<typ:BillFromGeographyType2>ADDRESS2</typ:BillFromGeographyType2>
					<typ:BillFromGeographyType3>ADDRESS3</typ:BillFromGeographyType3>
					<typ:BillFromGeographyType4>ADDRESS4</typ:BillFromGeographyType4>
					<typ:BillFromGeographyType5>COUNTRY</typ:BillFromGeographyType5>
					<typ:BillFromGeographyType6>STATE</typ:BillFromGeographyType6>
					<typ:BillFromGeographyType7>COUNTY</typ:BillFromGeographyType7>
					<typ:BillFromGeographyType8>CITY</typ:BillFromGeographyType8>
					<typ:BillFromGeographyType9>POSTALCODE</typ:BillFromGeographyType9>
					<typ:BillFromGeographyValue1>5430 One Shields Avenue</typ:BillFromGeographyValue1>
					<typ:BillFromGeographyValue5>US</typ:BillFromGeographyValue5>
					<typ:BillFromGeographyValue6>Pennsylvania</typ:BillFromGeographyValue6>
					<typ:BillFromGeographyValue8>Berwyn</typ:BillFromGeographyValue8>
					<typ:BillFromGeographyValue9>19312</typ:BillFromGeographyValue9>
					<typ:BillFromLocationId>300000001141673</typ:BillFromLocationId>
					<typ:BillThirdPtyAcctId>300000019736567</typ:BillThirdPtyAcctId>
					<typ:BillThirdPtyAcctSiteId>300000019736568</typ:BillThirdPtyAcctSiteId>
					<typ:BillToGeographyType1>ADDRESS1</typ:BillToGeographyType1>
					<typ:BillToGeographyType10>PROVINCE</typ:BillToGeographyType10>
					<typ:BillToGeographyType2>ADDRESS2</typ:BillToGeographyType2>
					<typ:BillToGeographyType3>ADDRESS3</typ:BillToGeographyType3>
					<typ:BillToGeographyType4>ADDRESS4</typ:BillToGeographyType4>
					<typ:BillToGeographyType5>COUNTRY</typ:BillToGeographyType5>
					<typ:BillToGeographyType6>STATE</typ:BillToGeographyType6>
					<typ:BillToGeographyType7>COUNTY</typ:BillToGeographyType7>
					<typ:BillToGeographyType8>CITY</typ:BillToGeographyType8>
					<typ:BillToGeographyType9>POSTALCODE</typ:BillToGeographyType9>
					<typ:BillToGeographyValue1>123 Main St</typ:BillToGeographyValue1>
					<typ:BillToGeographyValue5>US</typ:BillToGeographyValue5>
					<typ:BillToGeographyValue6>Pennsylvania</typ:BillToGeographyValue6>
					<typ:BillToGeographyValue7>Chester</typ:BillToGeographyValue7>
					<typ:BillToGeographyValue8>Exton</typ:BillToGeographyValue8>
					<typ:BillToGeographyValue9>19341</typ:BillToGeographyValue9>
					<typ:BillToLocationId>300000019736570</typ:BillToLocationId>
					<typ:CashDiscount>0</typ:CashDiscount>
					<typ:EntityCode>ORDER</typ:EntityCode>
					<typ:EventClassCode>SALES_TRANSACTION_TAX_QUOTE</typ:EventClassCode>
					<typ:ExemptionControlFlag>S</typ:ExemptionControlFlag>
					<typ:LineAmt>4000</typ:LineAmt>
					<typ:LineAmtIncludesTaxFlag>S</typ:LineAmtIncludesTaxFlag>
					<typ:LineClass>INVOICE</typ:LineClass>
					<typ:LineLevelAction>CREATE</typ:LineLevelAction>
					<typ:LinesDetFactorId>3944032</typ:LinesDetFactorId>
					<typ:PoaGeographyType1>ADDRESS1</typ:PoaGeographyType1>
					<typ:PoaGeographyType10>PROVINCE</typ:PoaGeographyType10>
					<typ:PoaGeographyType2>ADDRESS2</typ:PoaGeographyType2>
					<typ:PoaGeographyType3>ADDRESS3</typ:PoaGeographyType3>
					<typ:PoaGeographyType4>ADDRESS4</typ:PoaGeographyType4>
					<typ:PoaGeographyType5>COUNTRY</typ:PoaGeographyType5>
					<typ:PoaGeographyType6>STATE</typ:PoaGeographyType6>
					<typ:PoaGeographyType7>COUNTY</typ:PoaGeographyType7>
					<typ:PoaGeographyType8>CITY</typ:PoaGeographyType8>
					<typ:PoaGeographyType9>POSTALCODE</typ:PoaGeographyType9>
					<typ:PoaGeographyValue1>5430 One Shields Avenue</typ:PoaGeographyValue1>
					<typ:PoaGeographyValue5>US</typ:PoaGeographyValue5>
					<typ:PoaGeographyValue6>Pennsylvania</typ:PoaGeographyValue6>
					<typ:PoaGeographyValue8>Berwyn</typ:PoaGeographyValue8>
					<typ:PoaGeographyValue9>19312</typ:PoaGeographyValue9>
					<typ:PoaLocationId>300000001141673</typ:PoaLocationId>
					<typ:Precision>2</typ:Precision>
					<typ:ProductCode>Item1000</typ:ProductCode>
					<typ:ProductFiscClassification>Photography_Equipment</typ:ProductFiscClassification>
					<typ:ProductId>300000019546448</typ:ProductId>
					<typ:ProductOrgId>300000005503393</typ:ProductOrgId>
					<typ:ProductType>GOODS</typ:ProductType>
					<typ:ShipToGeographyType1>ADDRESS1</typ:ShipToGeographyType1>
					<typ:ShipToGeographyType10>PROVINCE</typ:ShipToGeographyType10>
					<typ:ShipToGeographyType2>ADDRESS2</typ:ShipToGeographyType2>
					<typ:ShipToGeographyType3>ADDRESS3</typ:ShipToGeographyType3>
					<typ:ShipToGeographyType4>ADDRESS4</typ:ShipToGeographyType4>
					<typ:ShipToGeographyType5>COUNTRY</typ:ShipToGeographyType5>
					<typ:ShipToGeographyType6>STATE</typ:ShipToGeographyType6>
					<typ:ShipToGeographyType7>COUNTY</typ:ShipToGeographyType7>
					<typ:ShipToGeographyType8>CITY</typ:ShipToGeographyType8>
					<typ:ShipToGeographyType9>POSTALCODE</typ:ShipToGeographyType9>
					<typ:ShipToGeographyValue1>123 Main St</typ:ShipToGeographyValue1>
					<typ:ShipToGeographyValue5>US</typ:ShipToGeographyValue5>
					<typ:ShipToGeographyValue6>Pennsylvania</typ:ShipToGeographyValue6>
					<typ:ShipToGeographyValue7>Chester</typ:ShipToGeographyValue7>
					<typ:ShipToGeographyValue8>Exton</typ:ShipToGeographyValue8>
					<typ:ShipToGeographyValue9>19341</typ:ShipToGeographyValue9>
					<typ:ShipToLocationId>300000019736570</typ:ShipToLocationId>
					<typ:TaxReportingFlag>N</typ:TaxReportingFlag>
					<typ:TrxBusinessCategory>SALES_TRANSACTION</typ:TrxBusinessCategory>
					<typ:TrxId>756899</typ:TrxId>
					<typ:TrxLineCurrencyCode>USD</typ:TrxLineCurrencyCode>
					<typ:TrxLineDate>2022-11-01</typ:TrxLineDate>
					<typ:TrxLineId>1</typ:TrxLineId>
					<typ:TrxLinePrecision>2</typ:TrxLinePrecision>
					<typ:TrxLineQuantity>4</typ:TrxLineQuantity>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:UnitPrice>1000</typ:UnitPrice>
					<typ:UomCode>zzu</typ:UomCode>
					<typ:TrxIdLevel2>300000030786461</typ:TrxIdLevel2>
				</typ:trxLine>
			</typ:trxLineList>
		</typ:calculation>
	</soapenv:Body>
</soapenv:Envelope>